#include <stdio.h>
#include <stdint.h>


uint16_t sum_for();
uint16_t sum_Formula(uint8_t sum);
uint16_t sum_while();

int main()
{
    uint16_t sum = 0;
    sum = sum_for();
    printf("for循环百数之和是%d\n",sum);
    sum = sum_Formula(/*填写内容*/100);
    printf("公式百数之和是%d\n",sum);
    sum = sum_while();
    printf("while百数之和是%d\n",sum);
}

uint16_t sum_for()
{
    printf("-----------------for循环执行-----------------\n");
    /* ***************内容填写区域*********************************** */

    /* ***************内容结束区域*********************************** */
}

uint16_t sum_Formula(uint8_t num)
{
    printf("-----------------公式法执行-----------------\n");
    /* ***************内容填写区域*********************************** */

    /* ***************内容结束区域*********************************** */
}

uint16_t sum_while()
{

    printf("-----------------while循环执行-----------------\n");
    /* ***************内容填写区域*********************************** */
    
    /* ***************内容结束区域*********************************** */
}

